# Pandas
used for data analysis and data cleaning
two primary data structure 
    1. Series:
        One Dim array like object
    2. DataFrame:
        2-D, size mutable, potentially haetrogeneous tabular data structure with labled axes.

In [1]:
import pandas as pd

In [1]:
# series 

import pandas as pd
data = [1,2,3,4,5]
series=pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [2]:
#create series from dictionary

data = {
    'a':1,
    'b':2,
    'c':3
}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [3]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [2]:
# Dataframe
# Create a dataframe using dictionary
import pandas as pd
data = {
    'Name': ['gyan', 'aman', 'shashi','nishi','abhi'],
    'Age':[25,30,35,22,26],
    'City':["Bengalore", 'Hyderabad', 'Chennai', 'Nepal', 'Varanasi']
}
df = pd.DataFrame(data)
print(df)

     Name  Age       City
0    gyan   25  Bengalore
1    aman   30  Hyderabad
2  shashi   35    Chennai
3   nishi   22      Nepal
4    abhi   26   Varanasi

In [4]:
# Create a data frame from a list of dictionary

data_list = [
    {'Name': 'gyan', 'Age': 25, 'City': 'Bengalore'},
    {'Name': 'aman', 'Age': 30, 'City': 'Hyderabad'},
    {'Name': 'shashi', 'Age': 35, 'City': 'Chennai'},
    {'Name': 'nishi', 'Age': 22, 'City': 'Nepal'},
    {'Name': 'abhi', 'Age': 26, 'City': 'Varanasi'}
]
pd.DataFrame(data_list)

     Name  Age       City
0    gyan   25  Bengalore
1    aman   30  Hyderabad
2  shashi   35    Chennai
3   nishi   22      Nepal
4    abhi   26   Varanasi

In [6]:
df = pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [7]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [10]:
# Accessing data from dataframe

df.head(5)['Category']

0    A
1    B
2    C
3    B
4    B
Name: Category, dtype: object

In [ ]:
df.head(5).loc[0] # access one row

Date        2023-01-01
Category             A
Value             28.0
Product       Product1
Sales            754.0
Region            East
Name: 0, dtype: object

In [16]:
## columns index

df.iloc[0]

Date        2023-01-01
Category             A
Value             28.0
Product       Product1
Sales            754.0
Region            East
Name: 0, dtype: object

In [19]:
# accessing a specified elements

df.at[2,'Product']

'Product2'

In [21]:

data_list = [
    {'Name': 'gyan', 'Age': 25, 'City': 'Bengalore'},
    {'Name': 'aman', 'Age': 30, 'City': 'Hyderabad'},
    {'Name': 'shashi', 'Age': 35, 'City': 'Chennai'},
    {'Name': 'nishi', 'Age': 22, 'City': 'Nepal'},
    {'Name': 'abhi', 'Age': 26, 'City': 'Varanasi'}
]
df = pd.DataFrame(data_list)
print(df)

     Name  Age       City
0    gyan   25  Bengalore
1    aman   30  Hyderabad
2  shashi   35    Chennai
3   nishi   22      Nepal
4    abhi   26   Varanasi

In [36]:
# Added a columm
df['Salary'] = [2000,3000,4000,5000,6000]
df

     Name  Age       City  Salary
0    gyan   25  Bengalore    2000
1    aman   30  Hyderabad    3000
2  shashi   35    Chennai    4000
3   nishi   22      Nepal    5000
4    abhi   26   Varanasi    6000

In [ ]:
# removing column

new_df = df.drop('Salary', axis=1) # it is a temproary , it does not save the state of the data
print(new_df)

     Name  Age       City
0    gyan   25  Bengalore
1    aman   30  Hyderabad
2  shashi   35    Chennai
3   nishi   22      Nepal
4    abhi   26   Varanasi

In [42]:
# in order to save the state use inplace=True for permanent removal
print(df)
per_df = df.drop('City', axis=1, inplace=True)
print(per_df)

     Name  Age       City
0    gyan   25  Bengalore
1    aman   30  Hyderabad
2  shashi   35    Chennai
3   nishi   22      Nepal
4    abhi   26   Varanasi
None

In [43]:
df.describe()

             Age
count   5.000000
mean   27.600000
std     5.029911
min    22.000000
25%    25.000000
50%    26.000000
75%    30.000000
max    35.000000

In [44]:
df

     Name  Age
0    gyan   25
1    aman   30
2  shashi   35
3   nishi   22
4    abhi   26